Messwerte/Archiv/Raw/apache_benchmark_repeat35/default/kata/nginx/target_count_21/repeat_6/5.txt
2020/01/16 23:29:16 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8005/
2020/01/16 23:29:46 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 17493 requests
Server Software:        nginx/1.17.7
Server Hostname:        192.168.3.100
Server Port:            8005
Document Path:          /
Document Length:        612 bytes
Concurrency Level:      100
Time taken for tests:   30.001 seconds
Complete requests:      17493
Failed requests:        0
Total transferred:      14781818 bytes
HTML transferred:       10705716 bytes
Requests per second:    583.08 [#/sec] (mean)
Time per request:       171.502 [ms] (mean)
Time per request:       1.715 [ms] (mean, across all concurrent requests)
Transfer rate:          481.17 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    8  36.6      2    1027
Processing:     2  163 267.4     52    2267
Waiting:        2  162 266.4     52    2267
Total:          5  171 271.0     59    2268
Percentage of the requests served within a certain time (ms)
  50%     59
  66%    160
  75%    221
  80%    249
  90%    398
  95%    528
  98%   1169
  99%   1658
 100%   2268 (longest request)
2020/01/16 23:29:46 Matched stat line [Connect:        0    8  36.6      2    1027 Connect 0 8 36.6 2 1027]
2020/01/16 23:29:46 Matched stat line [Processing:     2  163 267.4     52    2267 Processing 2 163 267.4 52 2267]
2020/01/16 23:29:46 Matched stat line [Waiting:        2  162 266.4     52    2267 Waiting 2 162 266.4 52 2267]
2020/01/16 23:29:46 Matched stat line [Total:          5  171 271.0     59    2268 Total 5 171 271.0 59 2268]
2020/01/16 23:29:46 Matched percentline [  50%     59 50 59]
2020/01/16 23:29:46 Matched percentline [  66%    160 66 160]
2020/01/16 23:29:46 Matched percentline [  75%    221 75 221]
2020/01/16 23:29:46 Matched percentline [  80%    249 80 249]
2020/01/16 23:29:46 Matched percentline [  90%    398 90 398]
2020/01/16 23:29:46 Matched percentline [  95%    528 95 528]
2020/01/16 23:29:46 Matched percentline [  98%   1169 98 1169]
2020/01/16 23:29:46 Matched percentline [  99%   1658 99 1658]
2020/01/16 23:29:46 Matched percentline [ 100%   2268 100 2268]
{"connect":{"max":1027,"mean":8,"median":2,"min":0,"stdDev":36.599998474121094},"percentiles":{"100":2268,"50":59,"66":160,"75":221,"80":249,"90":398,"95":528,"98":1169,"99":1658},"processing":{"max":2267,"mean":163,"median":52,"min":2,"stdDev":267.3999938964844},"total":{"max":2268,"mean":171,"median":59,"min":5,"stdDev":271},"waiting":{"max":2267,"mean":162,"median":52,"min":2,"stdDev":266.3999938964844}}